#!/usr/bin/env bash
#------------------------------------------------------------------------------
#переход в директорию текущего скрипта
cd $(dirname $(readlink -e $0))
#------------------------------------------------------------------------------

# удалить аварийно завершенные контейнеры
docker rm $(docker ps -a | grep "Exited ([^0]"|awk '{print $1}')

# Удалить образы без тега (временный мусор при сборке)
docker rmi $(docker images -f "dangling=true" -q)

#------------------------------------------------------------------------------

# Потушить созданные контейнеры и удалить образы
cd .. && docker-compose down --rmi=all
#------------------------------------------------------------------------------
